{
  "Slug": "carrot-cake",
  "IsDraft": false,
  "Title": "Carrot cake",
  "Author": "Felicity",
  "Date": "2022-10-01T21:46:05.577Z",
  "Intro": "Vegetables are a must on a diet. I suggest carrot cake, zucchini bread, and pumpkin pie. - Jim Davis\n",
  "HeroImage": "https://i.imgur.com/uUFQdHi.jpg",
  "Body": "While I sit here listening to my folksy/pop faves You\u002BMe, sipping on my now cold coffee, trying to suss out why I love this cake so much, it dawns on me that it\u0027s really the simplicity of it. That and it tastes bloody delicious. This cake is also the clear winner on the birthday choice front for my other half/photo extraordinaire Isaac, picking it every year for a good 10 years.\n\nWhat makes this beauty even more appealing is the fact that it is a one bowl, quick mix cake. I mean who really has the time to do the equivalent of a family of 6\u0027s dishes every time a cake is made. I sure don\u0027t. Nah uh, no way.\n\nI stumbled upon this recipe years ago and over time have converted it to be safe for us gluten free folks. I love that it\u0027s not fussy, with no added extras that blur the line between carrot and hummingbird cakes. It is carrot cake in its purest form. The best form. Why fix what\u0027s not broken eh? The final flourish is a good helping of the best cream cheese icing I have ever used, cleverly created by the team at Miette.\n\nNotes:\u2028\nYou are more than welcome to switch out the flour to GF pre-mix from the supermarket. Just make sure to check if it has raising agents or gums in it already, if so, adjust the recipe accordingly.",
  "Rating": {
    "AverageRating": 5,
    "TimesRated": 2
  },
  "PrepTime": "10 mins",
  "CookTime": "75 mins",
  "QuantitySizeMade": "1 x 8\u0022 cake",
  "Ingredients": [
    "130g tapioca starch",
    "120g brown rice flour",
    "50g potato starch",
    "1 1/2 tsp ground cinnamon",
    "1/2 tsp ground ginger",
    "2 tsp baking soda",
    "2 tsp baking powder",
    "1/2 tsp table salt",
    "1 tsp xanthan gum",
    "200g walnuts, coarsley chopped",
    "300g caster sugar",
    "500g grated carrot",
    "4 eggs",
    "2 tsp vanilla extract",
    "250ml vegetable oil",
    "165g unsalted butter at room temp.",
    "165g icing sugar, sifted",
    "250g cream cheese at room temp",
    "extra walnuts for sprinkling"
  ],
  "Method": [
    "Preheat oven to 180°C Bake. Grease and line a 8\u0022 round cake tin with baking paper and set aside.",
    "Place all dry ingredients in a large bowl and whisk to combine.",
    "Add the sugar, walnuts and carrot and mix thoroughly.",
    "Finally add the eggs, vanilla and oil and beat mixture with a wooden spoon until well combined.",
    "Pour into your lined tin and bake for 1hr 20 minutes or until a skewer inserted comes out clean.",
    "Let the cake cool completely in the tin before removing and icing.",
    "For the icing: with an electric mixer, combine icing sugar and butter until smooth and glossy.",
    "Add in the cream cheese and beat until there are no lumps.",
    "Spread generously on the top of the cake and finish with extra walnuts.",
    "Chill cake for 30 minutes before serving."
  ],
  "Tags": [
    "Cake",
    "Classic bakes"
  ],
  "Comments": [
    {
      "Rating": 5,
      "Comment": null,
      "Name": "Mandy Muffin",
      "Email": "mandy@example.com",
      "Date": "2022-10-20T22:36:25.724Z"
    },
    {
      "Rating": 5,
      "Comment": "Made this for my birthday. It was great!",
      "Name": "Leon Lemur",
      "Email": "leon@example.com",
      "Date": "2022-10-12T22:36:25.724Z"
    }
  ]
}