{
  "Slug": "chocolate-vanilla-cookie-sandwiches-",
  "IsDraft": false,
  "Title": "Chocolate vanilla cookie sandwiches ",
  "Author": "Felicity",
  "Date": "2022-11-07T00:12:31.816Z",
  "Intro": "AKA. homemade Oreo cookies",
  "HeroImage": "https://i.imgur.com/nAFtkdE.jpg",
  "Body": "I have been a big big fan of Tarek Malouf, founder of The Hummingbird Bakery, for a while now. I own a copy of all four of his cookbooks and used some of my 24 hours in London to search out his bakery and scoff my face with sugary goodness. \nI am a frequent maker of his loaves, cupcakes and cakes but it dawned on me that I hadn’t had the pleasure of giving his cookies a whirl. What a crime!\n\nThis recipe caught my eye immediately (not kidding, these bad boys are on the front cover of ‘Life is Sweet’) and I had to make them. \n\nThese are the right amount of crunchy on the outside, chewy in the middle, sandwiched with a great vanilla buttercream that smooshes out the side as you try to eat them delicately. \n\nAs always I have converted this recipe to be gluten free but feel free to swap the GF flour out for standard, and I’ve adjusted the icing sugar in the buttercream icing back to a non-American sugar coma level.",
  "Rating": {
    "AverageRating": 4.75,
    "TimesRated": 4
  },
  "PrepTime": "15 mins",
  "CookTime": "10 mins \u002B cooling",
  "QuantitySizeMade": "25-30 filled cookies",
  "Ingredients": [
    "170g plain GF flour",
    "90g cocoa",
    "1 tsp baking soda",
    "1/4 tsp baking powder",
    "1/4 tsp table salt",
    "140g unsalted butter at room temp",
    "320g caster sugar",
    "1 egg",
    "230g unsalted butter at room temp (for icing) ",
    "190g icing sugar",
    "2 tsp vanilla essence",
    "125g white chocolate, melted and cooled",
    "1 pinch table salt"
  ],
  "Method": [
    "Pre-heat oven to 190°C Bake. Line two large baking trays with baking paper and set aside.",
    "Put dry ingredients in a medium bowl together and give it a whisk to combine.",
    "Using a stand mixer, cream the butter and sugar together for 5 minutes until light and fluffy. Add the egg and beat on medium speed until just incorporated.",
    "Lower the speed and add the dry ingredients gradually until the dough is well combined.",
    "Roll tablespoon measures of the dough  and place on the lined trays, about 5 cm apart.",
    "Put the extra caster sugar on a small plate. Press the bottom of the glass into the sugar then use this to flatten the dough to about 5mm thick.",
    "Bake for approx. 10 minutes until the cookies are firm. Transfer to wire racks to cool completely.",
    "To make the filling, beat butter, icing sugar and vanilla together in a stand mixer until combined.",
    "Add chocolate and beat for 3 minutes.",
    "Finally add salt and beat to combine.",
    "Pipe or spread some icing on one half of the cookies, topping it with another cookie to create a sandwich."
  ],
  "Tags": [
    "Cookie",
    "Chocolate"
  ],
  "Comments": [
    {
      "Rating": 5,
      "Comment": "Delicious. Made these for the family and they loved them.",
      "Name": "Freddy Forever",
      "Email": "fred@example.com",
      "Date": "2022-12-13T22:36:25.724Z"
    },
    {
      "Rating": 5,
      "Comment": "Thanks for sharing your recipe.",
      "Name": "George Georgeson",
      "Email": "george@example.com",
      "Date": "2022-12-03T22:36:25.724Z"
    },
    {
      "Rating": 5,
      "Comment": "Oh yum! These were great.",
      "Name": "Harry Houdini",
      "Email": "hazz@example.com",
      "Date": "2022-11-29T22:36:25.724Z"
    },
    {
      "Rating": 4,
      "Comment": "Yum. I added some chopped chocolate to the icing and it was great.",
      "Name": "Ian Iver",
      "Email": "ian@example.com",
      "Date": "2022-11-09T22:36:25.724Z"
    }
  ]
}