{
  "Slug": "ginger-crunch",
  "IsDraft": false,
  "Title": "Ginger crunch",
  "Author": "Felicity",
  "Date": "2022-09-16T21:15:25.451Z",
  "Intro": "Let\u0027s talk ginger crunch for a while shall we?\nA classic Kiwi slice, baked by everyone\u0027s nan at some stage, ginger crunch has got to be a favourite in most households. Here\u0027s my version.",
  "HeroImage": "https://i.imgur.com/Or9N9Ga.jpg",
  "Body": "My rocking Nana Joan is still baking ginger crunch on a regular basis for the family visitors every weekend, even though she is a young 95 and has every right to pass the ginger crunch making buck onto someone else.\n\nCrunchy buttery biscuit base, topped with an equal layer of one hell of a ginger punch icing, the following recipe quickly became a farmers market favourite for The Sweet Eatery, a previous business of mine. In fact, we had one lady who at first put her nose up to it for being GF, however upon trying it she became quite a regular purchasing at least 4 slices every week. Yep that\u0027s right people, don\u0027t knock it before you try it!\n\nWell Nana Joan, let\u0027s continue spreading the love for this kiwi classic shall we?",
  "Rating": {
    "AverageRating": 5,
    "TimesRated": 3
  },
  "PrepTime": "15 mins",
  "CookTime": "15 mins plus cooling",
  "QuantitySizeMade": "1 x 20x30cm tray",
  "Ingredients": [
    "2 1/2 cups gluten free flour",
    "1 cup caster sugar",
    "2 tsp ground ginger",
    "250g butter, softened",
    "300g butter (for the topping)",
    "1/2 cup golden syrup",
    "3 Tbsp ground ginger (for the topping)",
    "3 cups icing sugar"
  ],
  "Method": [
    "Preheat oven to 180˚C and line a slice tin (20 x 30cm) with baking paper. Set aside",
    "Combine the flour, caster sugar, and 2tsp ginger in a bowl, then rub the first measure of butter in with your hands until it resembles breadcrumbs.",
    "Press into tin and bake for 15 minutes or until lightly golden. Set aside to cool while you make the topping.",
    "Melt the second measure of butter, syrup and 3 Tbsp of ginger together in a medium saucepan.",
    "Once melted, take it off the heat and stir through the icing sugar, then pour over the cooled base.",
    "Place in the fridge to set completely.",
    "To cut, heat a large knife under hot water, wipe clean on a tea towel and slice. Clean your knife between each cut to get nice, sharp pieces."
  ],
  "Tags": [
    "Sice",
    "Classic bakes"
  ],
  "Comments": [
    {
      "Rating": 5,
      "Comment": "Such a classic recipe. It was yum",
      "Name": "Roberto Ragu",
      "Email": "roberto@example.com",
      "Date": "2022-12-13T22:36:25.724Z"
    },
    {
      "Rating": 5,
      "Comment": null,
      "Name": "Steph Salad",
      "Email": "steph@example.com",
      "Date": "2022-10-03T22:36:25.724Z"
    },
    {
      "Rating": 5,
      "Comment": "Delicious",
      "Name": "Tim Tiny",
      "Email": "tim@example.com",
      "Date": "2022-09-19T22:36:25.724Z"
    }
  ]
}