{
  "Slug": "lemon-loaf",
  "IsDraft": false,
  "Title": "Lemon loaf",
  "Author": "Felicity",
  "Date": "2022-10-26T22:01:39.47Z",
  "Intro": "This is a fantastically zingy loaf that works a treat for morning or afternoon tea. Yum!",
  "HeroImage": "https://i.imgur.com/idG07VP.jpg",
  "Body": "I think that it is essential to have a good loaf recipe in your back pocket.\nYou know those times when people decide to drop round last minute - this is perfect for that.\nThe smell of lemon permeates the air in the most lovely way. Combine that with the smell of baked goods and you\u0027re onto a winner of a welcomer.\nThis can be easily taken to the next level with the addition of some fresh thyme leaves - 2 Tbsp chopped into the batter, and 3 sprigs added to the syrup.",
  "Rating": {
    "AverageRating": 4.5,
    "TimesRated": 2
  },
  "PrepTime": "20 mins",
  "CookTime": "20 mins",
  "QuantitySizeMade": "1 loaf",
  "Ingredients": [
    "190g butter",
    "190g self raising flour",
    "3 lemons",
    "230g caster sugar, split",
    "3 eggs",
    "1/4 tsp table salt",
    "25g sour cream (or plain greek yoghurt)",
    "40ml water"
  ],
  "Method": [
    "Preheat oven to 170˚C Bake. Line a loaf tin and set aside",
    "Cream the butter, 190g sugar and zest of 2 lemons",
    "Add the eggs, one at a time, beating after each addition for 20 seconds or so",
    "Add the flour and salt. Mix lightly",
    "Add the sour cream and mix to combine ensuring everything is well combined",
    "Pour into the loaf tin and bake for 20 minutes",
    "While the loaf bakes, make the syrup by combining the remaining sugar (40g), zest of 1 lemon, and the water in a small saucepan",
    "Bring to a boil then cook so it reduces by half",
    "Pour over the warm loaves and serve"
  ],
  "Tags": [
    "Lemon",
    "Easy",
    "Loaf"
  ],
  "Comments": [
    {
      "Rating": 5,
      "Comment": null,
      "Name": "John Jacobson",
      "Email": "john@example.com",
      "Date": "2022-11-23T22:36:25.724Z"
    },
    {
      "Rating": 4,
      "Comment": "Tasty recipe. Could use even more lemon in my opinion",
      "Name": "Kieran Kruger",
      "Email": "kieran@example.com",
      "Date": "2022-10-29T22:36:25.724Z"
    }
  ]
}